GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/*
   处理每个要发送信息的状态
   现在允许并行处理吗?

   2013.06.08增加多包发送处理
 */
#if 0
static MsgListRet jt808_tx_proc( MsgListNode * node )
{
	MsgListNode			* pnode		= ( MsgListNode* )node;
	JT808_TX_NODEDATA	* pnodedata = ( JT808_TX_NODEDATA* )( pnode->data );
	int					i;
	rt_err_t			ret;

	if( node == RT_NULL )
	{
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == IDLE )                      /*空闲，发送信息或超时后没有数据*/
	{
		if( pnodedata->retry >= jt808_param.id_0x0003 ) /*超过了最大重传次数*/                                                                     /*已经达到重试次数*/
		{
			/*表示发送失败*/
			pnodedata->cb_tx_timeout( pnodedata );      /*调用发送失败处理函数*/
			return MSGLIST_RET_DELETE_NODE;
		}
		/*要判断是不是出于GSM_TCPIP状态,当前socket是否可用*/
		if( gsmstate( GSM_STATE_GET ) != GSM_TCPIP )
		{
			return MSGLIST_RET_OK;
		}
		if( connect_state.server_state != CONNECTED )
		{
			return MSGLIST_RET_OK;
		}

		ret = socket_write( pnodedata->linkno, pnodedata->tag_data, pnodedata->msg_len );
		if( ret == RT_EOK ) /*发送成功等待中心应答中*/
		{
			pnodedata->tick = rt_tick_get( );
			pnodedata->retry++;
			pnodedata->timeout	= pnodedata->retry * jt808_param.id_0x0002 * RT_TICK_PER_SECOND;
			pnodedata->state	= WAIT_ACK;
			rt_kprintf( "send retry=%d,timeout=%d\r\n", pnodedata->retry, pnodedata->timeout * 10 );
		}else /*发送数据没有等到模块返回的OK，立刻重发，还是等一段时间再发*/
		{
			pnodedata->retry++;         /*置位再次发送*/
			total_send_error++;
			rt_kprintf( "total_send_error=%d\r\n", total_send_error );
		}
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == WAIT_ACK )  /*检查中心应答是否超时*/
	{
		if( rt_tick_get( ) - pnodedata->tick > pnodedata->timeout )
		{
			pnodedata->state = IDLE;
		}
		return MSGLIST_RET_OK;
	}

	if( pnodedata->state == ACK_OK )
	{
		return MSGLIST_RET_DELETE_NODE;
	}

	return MSGLIST_RET_OK;
}

#endif

/*发送控制*/
static JT808_MSG_STATE jt808_tx_proc( MsgListNode * node )
{
	MsgListNode			* pnode		= ( MsgListNode* )node;
	JT808_TX_NODEDATA	* pnodedata = ( JT808_TX_NODEDATA* )( pnode->data );
	rt_err_t			ret;

	if( node == RT_NULL )
	{
		return IDLE;
	}

	if( pnodedata->state == IDLE ) /*空闲，发送信息或超时后没有数据*/
	{
#if 1
		/*要判断是不是出于GSM_TCPIP状态,当前socket是否可用*/
		if( gsmstate( GSM_STATE_GET ) != GSM_TCPIP )
		{
			return IDLE;
		}
		if( connect_state.server_state != CONNECTED )
		{
			return IDLE;
		}
		rt_kprintf( "\n%d socket>", rt_tick_get( ) );
		ret = socket_write( pnodedata->linkno, pnodedata->tag_data, pnodedata->msg_len );
#else
		do
		{
			uint8_t* pdata = pnodedata->tag_data;
			rt_kprintf( "\r\n>DUMP BEGIN\r\n" );
			for( i = 0; i < pnodedata->msg_len; i++ )
			{
				if( ( i % 16 ) == 0 )
				{
					rt_kprintf( "\r\n" );
				}
				rt_kprintf( "%02x ", *pdata++ );
			}
			rt_kprintf( "\r\n>DUMP END\r\n" );
		}
		while( 0 );
		ret = RT_EOK;
#endif
		if( ret != RT_EOK )             /*gsm<ERROR:41 发送数据没有等到模块返回的OK，立刻重发，还是等一段时间再发*/
		{
			total_send_error++;
			rt_kprintf( "\ntotal_send_error=%d", total_send_error );
			if( total_send_error > 3 )  /*m66 发送失败,如何处理*/
			{
				total_send_error = 0;
				connect_state.server_state =CONNECT_IDLE ;
				connect_state.auth_state =CONNECT_IDLE ;
				gsmstate( GSM_POWEROFF );
			}
			
		}
		tick_server_heartbeat = rt_tick_get( );

		if( pnodedata->type == SINGLE_ACK )                                                             /*应答信息，只发一遍，发完删除即可*/
		{
			return WAIT_DELETE;
		}

		pnodedata->timeout_tick = rt_tick_get( ) + ( pnodedata->retry + 1 ) * pnodedata->timeout - 30;  /*减30是为了修正*/
		pnodedata->state		= WAIT_ACK;
		rt_kprintf( "\n%d>send id=%04x (%d/%d) timeout=%d",
		            rt_tick_get( ),
		            pnodedata->head_id,
		            pnodedata->retry,
		            pnodedata->max_retry,
		            ( pnodedata->retry + 1 ) * pnodedata->timeout * 10 );
		return IDLE;
	}

	if( pnodedata->state == WAIT_ACK )                                                   /*检查中心应答是否超时*/
	{
		if( rt_tick_get( ) >= pnodedata->timeout_tick )
		{
			pnodedata->retry++;
			if( pnodedata->retry >= pnodedata->max_retry )
			{
				return pnodedata->cb_tx_timeout( pnodedata );
			}else
			{
				pnodedata->state = IDLE;
				return IDLE; /*等待下次发送*/
			}
		}
		return WAIT_ACK;
	}

	if( pnodedata->state == ACK_OK )
	{
		return WAIT_DELETE;
	}
	return pnodedata->state;
}

/*
   808连接处理
   是以gsm状态迁移的,如果已层次状态机的模型，
   是不是从顶到底的状态处理会更好些。

   jt808_state   注册，鉴权 ，正常上报，停报
   socket_state
   gsm_state

 */
static void jt808_socket_proc( void )
{
	T_GSM_STATE state;
	uint8_t		buf[64];


/*
   检查是否允许gsm工作
   中间的时候关闭连接
 */
	if( connect_state.disable_connect )
	{
		return;
	}

/*检查GSM状态*/
	state = gsmstate( GSM_STATE_GET );
	if( state == GSM_IDLE )
	{
		gsmstate( GSM_POWERON );                /*开机登网*/
		return;
	}
	return;		/*临时测试不登网*/
/*控制登网*/
	if( state == GSM_AT )                       /*这里要判断用那个apn user psw 登网*/
	{
		if( connect_state.server_index % 2 )    /*用备用服务器*/
		{
			ctl_gprs( jt808_param.id_0x0014, \
			          jt808_param.id_0x0015, \
			          jt808_param.id_0x0016, \
			          1 );
		}else /*用主服务器*/
		{
			ctl_gprs( jt808_param.id_0x0010, \
			          jt808_param.id_0x0011, \
			          jt808_param.id_0x0012, \
			          1 );
		}
		return;
	}
/*控制建立连接*/
	if( state == GSM_TCPIP )                                /*已经在线了*/
	{
		if( connect_state.server_state == CONNECT_IDLE )
		{
			if( connect_state.server_index % 2 )            /*连备用服务器*/
			{
				ctl_socket( 1, 't', jt808_param.id_0x0017, jt808_param.id_0x0018, 1 );
			}else /*连主服务器*/
			{
				ctl_socket( 1, 't', jt808_param.id_0x0013, jt808_param.id_0x0018, 1 );
			}
			connect_state.server_state = CONNECT_PEER;      /*此时gsm_state处于 GSM_SOCKET_PROC，连完后返回 GSM_TCPIP*/
			return;
		}

		if( connect_state.server_state == CONNECT_PEER )    /*正在连接到服务器*/
		{
			if( socketstate( SOCKET_STATE ) == SOCKET_READY )
			{
				connect_state.server_state = CONNECTED;
			}else /*没有连接成功,切换服务器*/
			{
				connect_state.server_index++;
				connect_state.server_state = CONNECT_IDLE;
			}
		}

		if( connect_state.server_state == CONNECTED )                   /*链路维护心跳包*/
		{
			/*判断当前链接是否异常*/
			if( socketstate( SOCKET_STATE ) == CONNECT_CLOSE )          /*链接被挂断，是主动挂断还是网络原因*/
			{
				connect_state.server_state	= CONNECT_IDLE;             /*还是在cb_socket_close中判断*/
				jt808_state					= AUTH;                     /*重新连接要重新鉴权*/
				return;
			}

			switch( jt808_state )
			{
				case REGISTER:
					buf[0]	= jt808_param.id_0x0081 >> 8;               /*省域*/
					buf[1]	= jt808_param.id_0x0081 & 0xff;
					buf[2]	= jt808_param.id_0x0082 >> 8;               /*市域*/
					buf[3]	= jt808_param.id_0x0082 & 0xff;
					memcpy( buf + 4, jt808_param.id_0xF000, 5 );        /*制造商ID*/
					memcpy( buf + 9, jt808_param.id_0xF001, 20 );       /*终端型号*/
					memcpy( buf + 29, jt808_param.id_0xF002, 7 );       /*终端ID*/
					buf[36] = jt808_param.id_0xF004;
					strcpy( (char*)buf + 37, jt808_param.id_0xF005 );   /*车辆表示或VIN*/
					jt808_add_tx( 1,
					              SINGLE_FIRST,
					              0x0100,
					              -1, RT_NULL, RT_NULL,
					              37 + strlen( jt808_param.id_0xF005 ), buf, RT_NULL );
					jt808_state = WAIT;
					break;
				case AUTH:
					jt808_add_tx( 1,
					              SINGLE_FIRST,
					              0x0102,
					              -1, RT_NULL, RT_NULL,
					              strlen( jt808_param.id_0xF003 ),
					              (uint8_t*)( jt808_param.id_0xF003 ), RT_NULL );
					jt808_state = WAIT;
					break;
				case REPORT:
					if( tick_server_heartbeat )
					{
						/*要发送心跳包*/
						if( ( rt_tick_get( ) - tick_server_heartbeat ) >= ( jt808_param.id_0x0001 * RT_TICK_PER_SECOND ) )
						{
							jt808_tx_ack( 0x0002, buf, 0 );
							tick_server_heartbeat = rt_tick_get( ); /*首次用保留当前时刻*/
						}
					}else
					{
						tick_server_heartbeat = rt_tick_get( ); /*首次用保留当前时刻*/
					}
					break;
			}

			return;                                             /*直接返回，不连ICCARD*/
		}

		if( connect_state.server_state == CONNECT_CLOSE )       /*链接关闭，区分主动还是被动关闭*/
		{
			connect_state.server_state	= CONNECT_IDLE;         /*重新连接*/
			jt808_state					= AUTH;                 /*重新连接要重新鉴权*/
		}

