GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
		/*连接IC卡服务器*/

		if( connect_state.auth_state == CONNECT_IDLE )          /*没有连接*/
		{
			if( connect_state.auth_index % 2 )                  /*连备用服务器*/
			{
				ctl_socket( 2, 't', jt808_param.id_0x001A, jt808_param.id_0x001B, 1 );
			}else /*连主服务器*/
			{
				ctl_socket( 2, 't', jt808_param.id_0x001D, jt808_param.id_0x001B, 1 );
			}
			connect_state.auth_state = CONNECT_PEER;
			return;
		}

		if( connect_state.auth_state == CONNECT_PEER ) /*正在连接到服务器*/
		{
			if( socketstate( SOCKET_STATE ) == SOCKET_READY )
			{
				connect_state.auth_state = CONNECTED;
			}else /*没有连接成功,切换服务器*/
			{
				//connect_state.auth_index++;
				//connect_state.auth_state=CONNECT_IDLE;
				//if(connect_state.auth_index>6)
				//{
				//}
			}
		}
	}
}

/*
   tts语音播报的处理

   是通过
   %TTS: 0 判断tts状态(怀疑并不是每次都有输出)
   还是AT%TTS? 查询状态
 */
void jt808_tts_proc( void )
{
	rt_err_t	ret;
	rt_size_t	len;
	uint8_t		*pinfo, *p;
	uint8_t		c;
	T_GSM_STATE oldstate;

	char		buf[20];
	char		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };
/*gsm在处理其他命令*/
	oldstate = gsmstate( GSM_STATE_GET );
	if( oldstate != GSM_TCPIP )
	{
		if( oldstate != GSM_AT )
		{
			return;
		}
	}

/*是否有信息要播报*/
	ret = rt_mb_recv( &mb_tts, (rt_uint32_t*)&pinfo, 0 );
	if( ret != RT_EOK )
	{
		return;
	}

	gsmstate( GSM_AT_SEND );

	GPIO_ResetBits( GPIOD, GPIO_Pin_9 ); /*开功放*/

	sprintf( buf, "AT%%TTS=2,3,5,\"" );

	rt_device_write( dev_gsm, 0, buf, strlen( buf ) );

	rt_kprintf( "%s", buf );

	len = ( *pinfo << 8 ) | ( *( pinfo + 1 ) );
	p	= pinfo + 2;
	while( len-- )
	{
		c		= *p++;
		buf[0]	= tbl[c >> 4];
		buf[1]	= tbl[c & 0x0f];
		rt_device_write( dev_gsm, 0, buf, 2 );
		rt_kprintf( "%c%c", buf[0], buf[1] );
	}
	buf[0]	= '"';
	buf[1]	= 0x0d;
	buf[2]	= 0x0a;
	buf[3]	= 0;
	rt_device_write( dev_gsm, 0, buf, 3 );
	rt_kprintf( "%s", buf );
/*不判断，在gsmrx_cb中处理*/
	rt_free( pinfo );
	ret = gsm_send( "", RT_NULL, "%TTS: 0", RESP_TYPE_STR, RT_TICK_PER_SECOND * 35, 1 );
	GPIO_SetBits( GPIOD, GPIO_Pin_9 ); /*关功放*/
	gsmstate( oldstate );
}

/*
   at命令处理，收到OK或超时退出
 */
void jt808_at_tx_proc( void )
{
	rt_err_t	ret;
	uint8_t		*pinfo, *p;

	T_GSM_STATE oldstate;

/*gsm在处理其他命令*/
	oldstate = gsmstate( GSM_STATE_GET );
	if( oldstate != GSM_TCPIP )
	{
		if( oldstate != GSM_AT )
		{
			return;
		}
	}

/*是否有信息要发送*/
	ret = rt_mb_recv( &mb_at_tx, (rt_uint32_t*)&pinfo, 0 );
	if( ret != RT_EOK )
	{
		return;
	}

	gsmstate( GSM_AT_SEND );
	p	= pinfo + 2;
	ret = gsm_send( (char*)p, RT_NULL, "OK", RESP_TYPE_STR, RT_TICK_PER_SECOND * 5, 1 );
	rt_kprintf( "\nat_tx=%d", ret );
	rt_free( pinfo );
	gsmstate( oldstate );
}

/*
   连接状态维护
   jt808协议处理

 */
ALIGN( RT_ALIGN_SIZE )
static char thread_jt808_stack [2048];
struct rt_thread thread_jt808;

/***/
static void rt_thread_entry_jt808( void * parameter )
{
	rt_err_t			ret;
	uint8_t				* pstr;

	MsgListNode			* iter;
	JT808_TX_NODEDATA	* pnodedata;

	GPIO_SetBits( GPIOD, GPIO_Pin_9 );      /*关功放*/
	jt808_misc_init( );
	jt808_gps_init( );

	list_jt808_tx	= msglist_create( );
	list_jt808_rx	= msglist_create( );
/*初始化其他信息*/
	if( strlen( jt808_param.id_0xF003 ) )   /*是否已有鉴权码*/
	{
		jt808_state = AUTH;
	}

	while( 1 )
	{
/*接收gprs信息*/
		ret = rt_mb_recv( &mb_gprsrx, ( rt_uint32_t* )&pstr, 5 );
		if( ret == RT_EOK )
		{
			jt808_rx_proc( pstr );
			rt_free( pstr );
		}

		jt808_socket_proc( );   /*jt808 socket处理*/

		jt808_tts_proc( );      /*tts处理*/

		jt808_at_tx_proc( );    /*at命令处理*/

/*短信处理*/
		//SMS_Process( );

/*发送信息逐条处理*/
		iter = list_jt808_tx->first;

		if( jt808_tx_proc( iter ) == WAIT_DELETE )  /*删除该节点*/
		{
			pnodedata = ( JT808_TX_NODEDATA* )( iter->data );
			rt_kprintf( "\n%d>free node(%04x) %p", rt_tick_get( ), pnodedata->head_id, pnodedata );
			rt_free( pnodedata->user_para );
			rt_free( pnodedata );                   /*删除节点数据*/
			list_jt808_tx->first = iter->next;      /*指向下一个*/
			rt_free( iter );
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}

	msglist_destroy( list_jt808_tx );
}

#define BKSRAM

#ifdef BKSRAM

/**/
void bkpsram_init( void )
{
	/* Enable the PWR APB1 Clock Interface */
	RCC_APB1PeriphClockCmd( RCC_APB1Periph_PWR, ENABLE );

	/* Allow access to BKP Domain */
	PWR_BackupAccessCmd( ENABLE );

	/* Enable BKPSRAM Clock */
	RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_BKPSRAM, ENABLE );

	/* Enable the Backup SRAM low power Regulator to retain it's content in VBAT mode */
	PWR_BackupRegulatorCmd( ENABLE );

	/* Wait until the Backup SRAM low power Regulator is ready */
	while( PWR_GetFlagStatus( PWR_FLAG_BRR ) == RESET )
	{
	}
	//rt_kprintf("\r\n BkpSram_init OK!");
}

/*********************************************************************************
  *函数名称:u8 BkpSram_write(u32 addr,u8 *data, u16 len)
  *功能描述:backup sram 数据写入
  *输	入:	addr	:写入的地址
   data	:写入的数据指针
   len		:写入的长度
  *输	出:	none
  *返 回 值:u8	:	0:表示操作失败，	1:表示操作成功
  *作	者:白养民
  *创建日期:2013-06-18
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 bkpsram_write( u32 addr, u8 * data, u16 len )
{
	u32 i;
	//addr &= 0xFFFC;
	//*(__IO uint32_t *) (BKPSRAM_BASE + addr) = data;
	for( i = 0; i < len; i++ )
	{
		if( addr < 0x1000 )
		{
			*(__IO uint8_t*)( BKPSRAM_BASE + addr ) = *data++;
		}else
		{
			return 0;
		}
		++addr;
	}
	return 1;
}

/*********************************************************************************
  *函数名称:u16 bkpSram_read(u32 addr,u8 *data, u16 len)
  *功能描述:backup sram 数据读取
  *输	入:	addr	:读取的地址
   data	:读取的数据指针
   len		:读取的长度
  *输	出:	none
  *返 回 值:u16	:表示实际读取的长度
  *作	者:白养民
  *创建日期:2013-06-18
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 bkpsram_read( u32 addr, u8 * data, u16 len )
{
	u32 i;
	//addr &= 0xFFFC;
	//data = *(__IO uint32_t *) (BKPSRAM_BASE + addr);
	for( i = 0; i < len; i++ )
	{
		if( addr < 0x1000 )
		{
			*data++ = *(__IO uint8_t*)( BKPSRAM_BASE + addr );
		}else
		{
			break;
		}
		++addr;
	}
	return i;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void bkpsram_wr( u32 addr, char *psrc )
{
	char pstr[128];
	memset( pstr, 0, sizeof( pstr ) );
	memcpy( pstr, psrc, strlen( psrc ) );
	bkpsram_write( addr, (uint8_t*)pstr, strlen( pstr ) + 1 );
}

FINSH_FUNCTION_EXPORT( bkpsram_wr, write from backup sram );

/**/
void bkpsram_rd( u32 addr )
{
	uint8_t pstr[128];
	bkpsram_read( addr, pstr, sizeof( pstr ) );
	rt_kprintf( "\nstr=%s", pstr );
}

