GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/jt808.c
/*
   收到tts信息并发送
   返回0:OK
    1:分配RAM错误
 */
rt_size_t tts_write( char* info, uint16_t len )
{
	uint8_t *pmsg;
	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( len + 2 );
	if( pmsg != RT_NULL )
	{
		*pmsg			= len >> 8;
		*( pmsg + 1 )	= len & 0xff;
		memcpy( pmsg + 2, info, len );
		rt_mb_send( &mb_tts, (rt_uint32_t)pmsg );
		return 0;
	}
	return 1;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t tts( char *s )
{
	tts_write( s, strlen( s ) );
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( tts, tts send );


/*
   发送AT命令
   如何保证不干扰,其他的执行，传入等待的时间

 */
rt_size_t at( char *sinfo )
{
	char		*pmsg;
	uint16_t	count;
	count = strlen( sinfo );

	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( count + 3 );
	if( pmsg != RT_NULL )
	{
		count=sprintf(pmsg+2,"%s\r\n",sinfo);
		pmsg[0]=count>>8;
		pmsg[1]=count&0xff;
		*( pmsg + count + 2 ) = 0;
		rt_mb_send( &mb_at_tx, (rt_uint32_t)pmsg );
		return 0;
	}
	return 1;
}

FINSH_FUNCTION_EXPORT( at, write gsm );


/*
   重启设备
   填充重启原因
 */
void reset( unsigned int reason )
{
/*没有发送的数据要保存*/

/*关闭连接*/

/*日志记录时刻重启原因*/

	rt_kprintf( "\n%08d reset>reason=%08x", rt_tick_get( ), reason );
/*执行重启*/
	rt_thread_delay( RT_TICK_PER_SECOND * 5 );
	NVIC_SystemReset( );
}

FINSH_FUNCTION_EXPORT( reset, restart device );

/*恢复出厂设置*/
void factory( void )
{
	uint16_t	i;
	uint32_t	addr = 51 * 4096;
	rt_enter_critical( );
	for( i = 51; i < 1024; i++ )
	{
		sst25_erase_4k( addr );
		addr += 4096;
	}
	NVIC_SystemReset( );
}

FINSH_FUNCTION_EXPORT( factory, reset to factory );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void list_node( void )
{
	MsgListNode			* iter;
	JT808_TX_NODEDATA	* pnodedata;

	iter = list_jt808_tx->first;
	while( iter != NULL )
	{
		pnodedata = ( JT808_TX_NODEDATA* )( iter->data );
		rt_kprintf( "\nid=%04x\tseq=%04x len=%d", pnodedata->head_id, pnodedata->head_sn, pnodedata->msg_len );
		iter = iter->next;
	}
	return;
}

FINSH_FUNCTION_EXPORT( list_node, list node );

/************************************** The End Of File **************************************/

